const mainText = ["<span class=\"dddd\">ФАКУЛЬТЕТУ</span> ОСНОВ<br>ТВОРЧОСТІ ТА РЕМЕСЛ",
    "<span class=\"dddd\">ФАКУЛЬТЕТУ</span> ВІЙСЬКОВИХ<br>НАУК ТА ТЕХНОЛОГІЙ",
    "<span class=\"dddd\">ФАКУЛЬТЕТУ</span> ГАРМОНІЇ З<br>ПРИРОДОЮ ТА ВРОЖАЄМ",
    "<span class=\"dddd\">ФАКУЛЬТЕТУ</span> МИСТЕЦТВ<br>І КУЛЬТУРИ",
    "<span class=\"dddd\">ФАКУЛЬТЕТУ</span> ЕКОЛОГІЇ <br>ТА БІОРІЗНОМАНІТТЯ",
    "<span class=\"dddd\">ФАКУЛЬТЕТУ</span> АЕРОДИНАМІКИ<br>ТА АТМОСФЕРНИХ ПРОЦЕСІВ"];
const listres = ["<li> Основи ковальського мистецтва та ремесл.</li><li> Теорія й практика роширення можливостей.</li><li> Родинне щастя: як кувати гармонію у шлюбі.</li>",
    "<li> Сратегія та тактика: грім як зброя.</li><li> Мистецтво блискавичної перемоги.</li><li> Захист кордонів і командна робота.</li>",
    "<li> Землеробство: від насіння до врожаю.</li><li> Цикли природи та їх вплив на життя.</li><li> Мистецтво святкування й об'єднання.</li>",
    "<li> Музичне мистецтво: від гармонії до імпровізації.</li><li> Основи поетичної майстерності.</li><li> Жіноча енергія та її вплив на світ.</li>",
    "<li> Збереження довкілля: екологія майбутнього.</li><li> Гармонія з природою: як жити в злагоді із землею.</li><li> Жіноча енергія та її вплив на світ.</li>",
    "<li> Потоки вітру та їхня енергетика.</li><li> Аеродинаміка в природі та техніці.</li><li> Фізика повіряних явищ.</li>"]
const about = ["На цьому факультеті вас навчать створювати справжні шедеври власними руками,<br>об'єднуючи традиції та сучасність. Під керівництвом Сварога будь-яка ідея<br>перетворюється на витвір мистецтва.",
    "Факультет виховує справжніх лідерів і стратегів, здатних здобути перемогу в будь-<br>яких обставинах. Залізна дисципліна та грозовий натиск Перуна – ключ до вашого <br>успіху!",
    "Цей факультет розкриє секрети природи та навчить працювати із землею, щоб <br>отримувати щедрі плоди. Крім знань, ви отримаєте заряд літньої радості та енергії від <br>наставника.",
    "Факультет допомагає розкрити ваші творчі таланти, незалежно від їхнього <br>спрямування. Велес надихає кожного студента розкрити творчий потенціал і знайти  <br> голос у мистецтві.",
    "Цей факультет для тих, хто хоче навчитися оберігати природу та<br>підтримувати баланс між людиною і середовищем. Лекції Мокош<br>надихають на великі екологічні звершення.",
    "Цей факультет для тих, хто хоче навчитися оберігати природу та<br>технології майбутнього. Під керівництвом Стрибога навіть найскладніші явища стають <br>зрозумілими та логічними",
]

document.addEventListener("DOMContentLoaded", function() {
    const fac = sessionStorage.getItem('facultet');
    let i;
    switch (fac) {
        case "Swarog": 
            i = 0;
            break;
        case "Perun": 
            i = 1;
            break;
        case "Kupalo": 
            i = 2;
            break;
        case "Veles": 
            i = 3;
            break;
        case "Mokosh": 
            i = 4;
            break;
        case "Stribog": 
            i = 5;
            break;
        default: 
            i = -1; 
            break;
    }

    if (i >= 0){
        document.getElementById('main_text').innerHTML = mainText[i];
        document.getElementById('listres').innerHTML = listres[i];
        document.getElementById('ab').innerHTML = about[i];
        document.getElementById('fac_im').src = "./img/res" + (i + 1) + ".svg"
    }
});